Education/IEEE 11073 SDC/Medical_Devices_Profile_for_Web_Services/DPWS_Messages/MetadataGetResponse.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:chan="http://schemas.microsoft.com/ws/2005/02/duplex" xmlns:wsa5="http://www.w3.org/2005/08/addressing" xmlns:pm="http://p11073-10207/draft6/pm/2016/12/08" xmlns:ext="http://p11073-10207/draft6/ext/2016/12/08" xmlns:dpws="http://docs.oasis-open.org/ws-dd/ns/dpws/2009/01" xmlns:si="http://standards.ieee.org/downloads/11073/11073-20702-2016/" xmlns:msg="http://p11073-10207/draft6/msg/2016/12/08" xmlns:wsd11="http://docs.oasis-open.org/ws-dd/ns/discovery/2009/01" xmlns:wse4="http://schemas.xmlsoap.org/ws/2004/08/eventing" xmlns:wst4="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:wsx4="http://schemas.xmlsoap.org/ws/2004/09/mex">
	<SOAP-ENV:Header>
		<wsa5:MessageID>urn:uuid:9ab9bf4d-e00b-4127-863f-5252934603b4</wsa5:MessageID>
		<wsa5:RelatesTo RelationshipType="http://www.w3.org/2005/08/addressing/reply">urn:uuid:b06e77f0-1c5f-11e7-808c-c247d6c531f6</wsa5:RelatesTo>
		<wsa5:To SOAP-ENV:mustUnderstand="true">http://www.w3.org/2005/08/addressing/anonymous</wsa5:To>
		<wsa5:Action SOAP-ENV:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/mex/GetMetadata/Response</wsa5:Action>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<wsx4:Metadata>
			<wsx4:MetadataSection Dialect="http://docs.oasis-open.org/ws-dd/ns/dpws/2009/01/Relationship">
				<dpws:Relationship Type="http://docs.oasis-open.org/ws-dd/ns/dpws/2009/01/host">
					<dpws:Host>
						<wsa5:EndpointReference>
							<wsa5:Address>urn:uuid:426896ea-edb7-425c-a4a3-ef7e892e94f4</wsa5:Address>
						</wsa5:EndpointReference>
					</dpws:Host>
					<dpws:Hosted>
						<wsa5:EndpointReference>
							<wsa5:Address>http://10.52.219.53:54556/426896ea-edb7-425c-a4a3-ef7e892e94f4/Get/</wsa5:Address>
						</wsa5:EndpointReference>
						<dpws:Types>msg:Get</dpws:Types>
						<dpws:ServiceId>Get</dpws:ServiceId>
					</dpws:Hosted>
				</dpws:Relationship>
			</wsx4:MetadataSection>
			<wsx4:MetadataSection Dialect="http://schemas.xmlsoap.org/wsdl/">
				<wsx4:Location>http://10.52.219.53:54556/426896ea-edb7-425c-a4a3-ef7e892e94f4/Get/?wsdl</wsx4:Location>
			</wsx4:MetadataSection>
		</wsx4:Metadata>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
